{
  "Unspecified": {
    "description": "You did not specify a plant specie in your settings.\n\nSelect yours to have custom advices!\n\nSelect \"None\" you hide this message.",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "You did not specify a plant specie in your settings.\n\nSelect yours to have custom advices!\n\nSelect \"None\" you hide this message.",
    "temperatureRange": "-Infinity/Infinity",
    "temperatureDescription": "You did not specify a plant specie in your settings.\n\nSelect yours to have custom advices!\n\nSelect \"None\" you hide this message.",
    "soilMoistureRange": "-Infinity/Infinity",
    "soilMoistureDescription": "You did not specify a plant specie in your settings.\n\nSelect yours to have custom advices!\n\nSelect \"None\" you hide this message.",
    "luminosityRange": "-Infinity/Infinity",
    "luminosityDescription": "You did not specify a plant specie in your settings.\n\nSelect yours to have custom advices!\n\nSelect \"None\" you hide this message."
  },
  "None": {
    "description": "Not really a plant specie, just hide all messages.",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "",
    "temperatureRange": "-Infinity/Infinity",
    "temperatureDescription": "",
    "soilMoistureRange": "-Infinity/Infinity",
    "soilMoistureDescription": "",
    "luminosityRange": "-Infinity/Infinity",
    "luminosityDescription": ""
  },
  "Anthurium / Tailflower": {
    "description": "Anthurium is a genus of about 1000 species of flowering plants, the largest genus of the arum family, Araceae. General common names include anthurium, tailflower, flamingo flower, and laceleaf. The genus is native to the Americas, where it is distributed from northern Mexico to northern Argentina and parts of the Caribbean.",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "Watering should be moderate, letting the soil of the pot dry. Always use soft, non-calcareous water (don't forget to collect rainwater!).",
    "temperatureRange": "20/23",
    "temperatureDescription": "This plant should be in a location at room temperature. Be careful not to put it next to a radiator.",
    "soilMoistureRange": "30/60",
    "soilMoistureDescription": "Do not forget to use fertilizer for this plant. See the advice section.",
    "luminosityRange": "550/650",
    "luminosityDescription": "The plant needs a bright room."
  },
  "Beaucarnea": {
    "description": "Beaucarnea is a genus of flowering plants native to Mexico and Central America.",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "Watering should be very regular during the period of growth, they should be spaced further in winter where a moderate watering is enough, allowing the soil to dry between two inflows of water.",
    "temperatureRange": "22/23",
    "temperatureDescription": "The beaucarnea prefers the high temperatures of the summer (do not hesitate to take it out on the balcony or terrace). During the winter, bring it inside( 18°C to 22°C are perfect.)",
    "soilMoistureRange": "30/60",
    "soilMoistureDescription": "Do not forget to use fertilizer for this plant. See the advice section.",
    "luminosityRange": "500/600",
    "luminosityDescription": "The beaucarnea delights in the light and supports the full sun. But he will get along also a half-shaded situation."
  },
  "Crocodile fern": {
    "description": "Native to Australia, crocodile fern (Microsorium musifolium ‘Crocydyllus’), sometimes known as crocodyllus fern, is an unusual plant with wrinkled, puckery leaves. The light green, segmented leaves are marked with dark green veins. Although the distinctive texture has been compared to a crocodile’s hide, the crocodile fern plant actually has a graceful, delicate appearance.",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "Do not wet the leaves to avoid leaf spots; do not allow stagnant water to avoid any risk of rot. Water more abundantly during the growth period. If the fronds turn yellow and the base of them begins to rot, it is due to too much watering. Then remove these yellow leaves and allow the substrate to dry slightly.",
    "temperatureRange": "20/23",
    "temperatureDescription": "This plant should be in a location at room temperature. Be careful not to put it next to a radiator.",
    "soilMoistureRange": "30/60",
    "soilMoistureDescription": "Do not forget to use fertilizer for this plant. See the advice section.",
    "luminosityRange": "500/600",
    "luminosityDescription": "Partial shade: no direct sun, average heat. Be careful, she has trouble recovering from heat stroke and aquarium effects"
  },
  "Ficus": {
    "description": "Ficus benjamina, commonly known as weeping fig, benjamin fig or Ficus tree, and often sold in stores as just ficus, is a species of flowering plant in the family Moraceae, native to Asia and Australia. It is the official tree of Bangkok. The species is also naturalized in the West Indies and in the States of Florida and Arizona in the United States",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "Water moderately, once a week, for example. Wait until the soil dries between 2 waterings, and if possible use non-calcareous water. Like other green plants, benjamina will appreciate you misting its foliage.",
    "temperatureRange": "15/22",
    "temperatureDescription": "This plant likes moderately heated rooms. In winter, a temperature of 15°C is largely sufficient; to exceed 22°C would be harmful.",
    "soilMoistureRange": "30/60",
    "soilMoistureDescription": "Liquid fertilizer every 15 days in the spring, or sticks of nutrients 3 times a year.",
    "luminosityRange": "550/650",
    "luminosityDescription": "This ficus calls for a bright light, without direct sun, during the period of growth. Place it in a very bright room. If they do not get enough of light, the variegated varieties tarnish."
  },
  "Moth orchids": {
    "description": "Phalaenopsis Blume, known as moth orchids, abbreviated Phal in the horticultural trade, is an orchid genus of approximately 60 species. Phalaenopsis is one of the most popular orchids in the trade, through the development of many artificial hybrids. It is native to southern China, Taiwan, the Indian Subcontinent, Southeast Asia (Thailand, Philippines, Malaysia, Indonesia, etc.), New Guinea, the Bismarck Archipelago, and Queensland.",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "Observe the appearance and color of the roots of your Phalaenopsis, these are good indicators. When the roots become greyish and dull, you can perform a watering. If they are still very green and shiny, then the plant does not need water. Excess watering is the leading cause of failure in orchid cultivation as it causes root rot. Water abundantly, but only once a week and especially, drain the pot well and do not leave water in the sub-pot. Also avoid wetting foliage.",
    "temperatureRange": "20/23",
    "temperatureDescription": "Fireplaces, radiators, stoves: In winter, the heat sources of the house are little appreciated by orchids. The heating dries the air of our interiors. However, orchids like wet environments and fear hot shots. Avoid installing them in rooms that are too heated (the living room for example) or near a heating system.",
    "soilMoistureRange": "30/60",
    "soilMoistureDescription": "Control the roots of the plant",
    "luminosityRange": "550/650",
    "luminosityDescription": "This plant needs full sun exposure."
  },
  "Pachira": {
    "description": "Pachira is a genus of tropical trees distributed in Central and South America, Africa and India. They are classified in the subfamily Bombacoideae of the family Malvaceae. Previously the genus was assigned to Bombacaceae. Prior to that the genus was found in the (now obsolete) Sterculiaceae.",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "In summer, water once a week, before the substrate is completely dry, and eventually bring green plant fertilizer from April to September. Reduce watering in winter (once every 10 to 15 days) and stop fertilizing.",
    "temperatureRange": "22/23",
    "temperatureDescription": "This plant should be in a location at room temperature. Be careful not to put it next to a radiator.",
    "soilMoistureRange": "30/60",
    "soilMoistureDescription": "Do not forget to use fertilizer for this plant. See the advice section.",
    "luminosityRange": "550/650",
    "luminosityDescription": "The plant needs a bright room."
  },
  "Philodendron": {
    "description": "Philodendron is a large genus of flowering plants in the Araceae family. As of September 2015, the World Checklist of Selected Plant Families accepted 489 species; other sources accept different numbers. Regardless of number of species, the genus is the second-largest member of the Araceae family. Taxonomically, the genus Philodendron is still poorly known, with many undescribed species. Many are grown as ornamental and indoor plants. The name derives from the Greek words philo- or \"love, affection\" and dendron or \"tree\". They are commonly called by their generic name.",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "Water only when the soil is dry on the surface (never leave water in the sub-pot). During the rest period, that is to say generally from November to February, space the waterings so as to allow the substrate to dry completely between two waterings.",
    "temperatureRange": "18/25",
    "temperatureDescription": "This plant should be in a location at room temperature. Be careful not to put it next to a radiator.",
    "soilMoistureRange": "30/60",
    "soilMoistureDescription": "Do not forget to use fertilizer for this plant. See the advice section.",
    "luminosityRange": "550/650",
    "luminosityDescription": "The plant needs a bright room or a full sun exposure"
    },
  "Satavar": {
    "description": "Asparagus racemosus (satavar, shatavari, or shatamull) is a species of asparagus common throughout Nepal, Sri Lanka, India and the Himalayas.",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "Water regularly during growth, that is, from spring to fall; space the waterings in winter.",
    "temperatureRange": "18/23",
    "temperatureDescription": "This plant should be in a location at room temperature. Be careful not to put it next to a radiator.",
    "soilMoistureRange": "30/60",
    "soilMoistureDescription": "Do not forget to use fertilizer for this plant. See the advice section.",
    "luminosityRange": "450/550",
    "luminosityDescription": "This plant needs a partial shade exposure."
  },
  "Spath / Peace lilies": {
    "description": "Spathiphyllum is a genus of about 40 species of monocotyledonous flowering plants in the family Araceae, native to tropical regions of the Americas and southeastern Asia. Certain species of Spathiphyllum are commonly known as Spath or peace lilies.",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "Watering should be regular during growth. However, let the mixture dry for 2 to 3 cm on the surface before re-watering and empty the cups so that the water does not stagnate at the roots. A fertilizer addition will be necessary every 15 days after a copious watering. In winter, space the waterings by letting the mixture dry a little deeper.",
    "temperatureRange": "18/23",
    "temperatureDescription": "This plant should be in a location at room temperature. Be careful not to put it next to a radiator.",
    "soilMoistureRange": "30/60",
    "soilMoistureDescription": "Compensate for lack of moisture induced by heating through daily foliar sprays. This will prevent the attacks of red spiders. It is also possible to place the plant on a large dish filled with moist clay balls.",
    "luminosityRange": "550/650",
    "luminosityDescription": "The plant needs a bright room."
  },
  "Umbrella tree": {
    "description": "Schefflera actinophylla is a tree in the Araliaceae family. It is native to tropical rainforests and gallery forests in Australia (eastern Queensland and the Northern Territory), New Guinea and Java. Common names include Australia umbrella tree,Queensland umbrella tree, octopus tree and amate.",
    "waterLevelRange": "-Infinity/Infinity",
    "waterLevelDescription": "Water parsimoniously by letting the soil dry between 2 waterings.",
    "temperatureRange": "16/20",
    "temperatureDescription": "Its successful acclimatization in apartment comes from the fact that it tolerates temperatures of 16 to 20°C throughout the year.",
    "soilMoistureRange": "30/60",
    "soilMoistureDescription": "Increase atmospheric humidity in winter by misting foliage once or twice a week in winter, and more often in summer.",
    "luminosityRange": "450/550",
    "luminosityDescription": "The plant will accommodate without concern a moderately bright room, even if it likes the light, under which it will develop more quickly. It will support a few hours of sun near a window.In summer, you can take it out in the garden. NEVER in full sun, but a few months in the shadow will be profitable.."
  }
}